In [1]:
## Data Analytics in Python  -> ML -> AI
##########################################################
# Descriptive Analysis
# Diagnostic Analysis
# Predictive Analysis - Machine Learning / Deep Learning
# Prescriptive Analysis - AI

In [2]:
# python -m pip install pandas

In [3]:
# Data Types
#### 1. Series: 1-D Data, single column data
#### 2. DataFrame: 2-D Data, multi-column/Tabular Data
#### 3. Panel: 3-D Data, multi-table data

In [5]:
import pandas as pd

In [5]:
s1 = pd.Series([4,6,8,934,3])
s1

0      4
1      6
2      8
3    934
4      3
dtype: int64

In [11]:
s2 = pd.Series(['hi','far','hi','far','far'])
s2

0     hi
1    far
2     hi
3    far
4    far
dtype: object

In [7]:
s1.sum()

955

In [8]:
s1.mean()

191.0

In [12]:
s2.value_counts()

far    3
hi     2
Name: count, dtype: int64

In [13]:
s1<10

0     True
1     True
2     True
3    False
4     True
dtype: bool

In [14]:
s1[s1<10]

0    4
1    6
2    8
4    3
dtype: int64

In [15]:
s2.str.upper()

0     HI
1    FAR
2     HI
3    FAR
4    FAR
dtype: object

In [16]:
s3 = pd.Series({'a':90,'s':85,'d':12,'f':34,'g':92})
s3

a    90
s    85
d    12
f    34
g    92
dtype: int64

In [17]:
s3['s']

85

In [18]:
s3[1]

85

In [19]:
s4 = pd.Series([7,3,6,8,3], index = ['a','x','p','n','k'])
s4

a    7
x    3
p    6
n    8
k    3
dtype: int64

In [20]:
s4.unique()

array([7, 3, 6, 8], dtype=int64)

In [21]:
s4.nunique()

4

In [22]:
s4.values

array([7, 3, 6, 8, 3], dtype=int64)

In [23]:
s4.max()

8

In [24]:
s4.idxmax()

'n'

In [25]:
df = pd.DataFrame([[5,6,7],[1,2,3],[2,4,6],[2,3,4]])
df

   0  1  2
0  5  6  7
1  1  2  3
2  2  4  6
3  2  3  4

In [26]:
df[0]

0    5
1    1
2    2
3    2
Name: 0, dtype: int64

In [27]:
df[0][3]

2

In [28]:
df.loc[1]

0    1
1    2
2    3
Name: 1, dtype: int64

In [29]:
df.T

   0  1  2  3
0  5  1  2  2
1  6  2  4  3
2  7  3  6  4

In [30]:
df1 = pd.DataFrame({ 'a' :[1,2,3,4,5,6,7,8], 'b' :['ad','af','ag','ah','zx','zc','qw','qe']})
df1

   a   b
0  1  ad
1  2  af
2  3  ag
3  4  ah
4  5  zx
5  6  zc
6  7  qw
7  8  qe

In [31]:
df1['a']

0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
Name: a, dtype: int64

In [32]:
df1.shape

(8, 2)

In [33]:
df1.count()

a    8
b    8
dtype: int64

In [34]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       8 non-null      int64
 1   b       8 non-null      object
dtypes: int64(1), object(1)
memory usage: 256.0+ bytes

In [35]:
df1.size

16

In [36]:
df1.head(4)

   a   b
0  1  ad
1  2  af
2  3  ag
3  4  ah

In [37]:
df1.tail(4)

   a   b
4  5  zx
5  6  zc
6  7  qw
7  8  qe

In [38]:
df1['c'] = pd.Series([11,22,33,44,55,66,77,88])
df1

   a   b   c
0  1  ad  11
1  2  af  22
2  3  ag  33
3  4  ah  44
4  5  zx  55
5  6  zc  66
6  7  qw  77
7  8  qe  88

In [39]:
df1[['b','c']]

    b   c
0  ad  11
1  af  22
2  ag  33
3  ah  44
4  zx  55
5  zc  66
6  qw  77
7  qe  88

In [40]:
df1[['b','c']][df1['c']%2 == 1]

    b   c
0  ad  11
2  ag  33
4  zx  55
6  qw  77

In [41]:
df1.describe(include='all')

              a    b          c
count   8.00000    8   8.000000
unique      NaN    8        NaN
top         NaN   ad        NaN
freq        NaN    1        NaN
mean    4.50000  NaN  49.500000
std     2.44949  NaN  26.944387
min     1.00000  NaN  11.000000
25%     2.75000  NaN  30.250000
50%     4.50000  NaN  49.500000
75%     6.25000  NaN  68.750000
max     8.00000  NaN  88.000000

In [42]:
df1.describe

<bound method NDFrame.describe of    a   b   c
0  1  ad  11
1  2  af  22
2  3  ag  33
3  4  ah  44
4  5  zx  55
5  6  zc  66
6  7  qw  77
7  8  qe  88>

In [43]:
df1.describe()

             a          c
count  8.00000   8.000000
mean   4.50000  49.500000
std    2.44949  26.944387
min    1.00000  11.000000
25%    2.75000  30.250000
50%    4.50000  49.500000
75%    6.25000  68.750000
max    8.00000  88.000000

In [44]:
# del df1['a']
df1.drop(['a'], axis=1, inplace=True)

In [45]:
df1.sample(3)

    b   c
0  ad  11
3  ah  44
2  ag  33

In [46]:
## Series/DataFrame
# - Create
# - Access
# - New Item Insert (DF)
# - Deletion (df.drop())

# Description
### info()
### unique()
### nunique()
### shape
### size
### count()
### describe()
### value_counts()
### head()
### tail()
### sample()
### columns
### index

# Stats
### sum()
### min()
### max()
### mean()
### idxmax()
### idxmin()

In [51]:
# File Operations
#################
# read
    # pd.read_csv
    # pd.read_json
    # pd.read_excel
    # ....
# write
    # df.to_csv('file.csv')
    # df.........

In [6]:
alc = pd.read_csv('alcohol-consumption-vs-gdp-per-capita.csv')

In [7]:
alc

,Entity,Code,Year,"Total alcohol consumption per capita (liters of pure alcohol, projected estimates, 15+ years of age)","GDP per capita, PPP (constant 2017 international $)",Population (historical estimates),Continent
0,Abkhazia,OWID_ABK,2015,NaN,NaN,NaN,Asia
1,Afghanistan,AFG,2010,0.21,1957.029070,29185511.0,NaN
2,Afghanistan,AFG,2015,0.21,2068.265904,34413603.0,Asia
3,Afghanistan,AFG,2018,0.21,2033.804389,37171922.0,NaN
4,Afghanistan,AFG,2002,NaN,1189.784668,22600774.0,NaN
...,...,...,...,...,...,...,...
57079,Zimbabwe,ZWE,1987,NaN,NaN,9527202.0,NaN
57080,Zimbabwe,ZWE,1988,NaN,NaN,9849129.0,NaN
57081,Zimbabwe,ZWE,1989,NaN,NaN,10153852.0,NaN
57082,Zimbabwe,ZWE,2021,NaN,NaN,15092171.0,NaN
57083,Åland Islands,ALA,2015,NaN,NaN,NaN,Europe

In [8]:
alc.sample(5)

,Entity,Code,Year,"Total alcohol consumption per capita (liters of pure alcohol, projected estimates, 15+ years of age)","GDP per capita, PPP (constant 2017 international $)",Population (historical estimates),Continent
50419,Tanzania,TZA,1943,NaN,NaN,6711298.0,NaN
44891,Seychelles,SYC,1852,NaN,NaN,14045.0,NaN
37052,North Korea,PRK,1868,NaN,NaN,4647634.0,NaN
39067,Palestine,PSE,1966,NaN,NaN,1184969.0,NaN
13360,Democratic Republic of Congo,COD,1962,NaN,NaN,16041187.0,NaN

In [9]:
alc.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 57084 entries, 0 to 57083
Data columns (total 7 columns):
 #   Column                                                                                                Non-Null Count  Dtype
---  ------                                                                                                --------------  -----
 0   Entity                                                                                                57084 non-null  object
 1   Code                                                                                                  54099 non-null  object
 2   Year                                                                                                  57084 non-null  int64
 3   Total alcohol consumption per capita (liters of pure alcohol, projected estimates, 15+ years of age)  1164 non-null   float64
 4   GDP per capita, PPP (constant 2017 international $)                                                   7109 non-null   float64
 5   Population (historical estimates)                                                                     55656 non-null  float64
 6   Continent                                                                                             285 non-null    object
dtypes: float64(3), int64(1), object(3)
memory usage: 3.0+ MB

In [10]:
Row = alc[alc['Year'] > 2020]

In [11]:
print(Row)

               Entity      Code  Year  \
259       Afghanistan       AFG  2021
518            Africa       NaN  2021
840           Albania       ALB  2021
1099          Algeria       DZA  2021
1213   American Samoa       ASM  2021
...               ...       ...   ...
56041  Western Sahara       ESH  2021
56300           World  OWID_WRL  2021
56560           Yemen       YEM  2021
56822          Zambia       ZMB  2021
57082        Zimbabwe       ZWE  2021

       Total alcohol consumption per capita (liters of pure alcohol, projected estimates, 15+ years of age)  \
259                                                  NaN
518                                                  NaN
840                                                  NaN
1099                                                 NaN
1213                                                 NaN
...                                                  ...
56041                                                NaN
56300                                                NaN
56560                                                NaN
56822                                                NaN
57082                                                NaN

       GDP per capita, PPP (constant 2017 international $)  \
259                                                  NaN
518                                                  NaN
840                                                  NaN
1099                                                 NaN
1213                                                 NaN
...                                                  ...
56041                                                NaN
56300                                                NaN
56560                                                NaN
56822                                                NaN
57082                                                NaN

       Population (historical estimates) Continent
259                         3.983543e+07       NaN
518                         1.373486e+09       NaN
840                         2.872934e+06       NaN
1099                        4.461663e+07       NaN
1213                        5.510300e+04       NaN
...                                  ...       ...
56041                       6.118720e+05       NaN
56300                       7.874966e+09       NaN
56560                       3.049064e+07       NaN
56822                       1.892066e+07       NaN
57082                       1.509217e+07       NaN

[242 rows x 7 columns]

In [12]:
my_col = list(Row.columns[0:4]) + ['Population (historical estimates)']

In [13]:
print(my_col)

['Entity', 'Code', 'Year', 'Total alcohol consumption per capita (liters of pure alcohol, projected estimates, 15+ years of age)', 'Population (historical estimates)']

In [15]:
df = alc[my_col]
df

,Entity,Code,Year,"Total alcohol consumption per capita (liters of pure alcohol, projected estimates, 15+ years of age)",Population (historical estimates)
0,Abkhazia,OWID_ABK,2015,NaN,NaN
1,Afghanistan,AFG,2010,0.21,29185511.0
2,Afghanistan,AFG,2015,0.21,34413603.0
3,Afghanistan,AFG,2018,0.21,37171922.0
4,Afghanistan,AFG,2002,NaN,22600774.0
...,...,...,...,...,...
57079,Zimbabwe,ZWE,1987,NaN,9527202.0
57080,Zimbabwe,ZWE,1988,NaN,9849129.0
57081,Zimbabwe,ZWE,1989,NaN,10153852.0
57082,Zimbabwe,ZWE,2021,NaN,15092171.0
57083,Åland Islands,ALA,2015,NaN,NaN

In [16]:
df.head()

,Entity,Code,Year,"Total alcohol consumption per capita (liters of pure alcohol, projected estimates, 15+ years of age)",Population (historical estimates)
0,Abkhazia,OWID_ABK,2015,NaN,NaN
1,Afghanistan,AFG,2010,0.21,29185511.0
2,Afghanistan,AFG,2015,0.21,34413603.0
3,Afghanistan,AFG,2018,0.21,37171922.0
4,Afghanistan,AFG,2002,NaN,22600774.0

In [17]:
df.to_csv('alcohol_consumption.csv',index=False)

# df.to_csv('alcohol_consumption.csv')

In [20]:
read_file = pd.read_csv('alcohol_consumption.csv')

# read_file = pd.read_csv('alcohol_consumption.csv', index_col = 0)

read_file.head()

,Entity,Code,Year,"Total alcohol consumption per capita (liters of pure alcohol, projected estimates, 15+ years of age)",Population (historical estimates)
0,Abkhazia,OWID_ABK,2015,NaN,NaN
1,Afghanistan,AFG,2010,0.21,29185511.0
2,Afghanistan,AFG,2015,0.21,34413603.0
3,Afghanistan,AFG,2018,0.21,37171922.0
4,Afghanistan,AFG,2002,NaN,22600774.0